app/Controllers/WarehouseManagerController.php

SELECT *
FROM `inventory`
---
    public function inventoryOverview()
    {
        $data['inventory'] = $this->inventoryModel->findAll();

SELECT *
FROM `inventory`
SELECT *
FROM `approvals`
---
    public function generateReport()
    {
        $type = $this->request->getGet('type') ?? 'inventory';
        $startDate = $this->request->getGet('start_date');
        $endDate = $this->request->getGet('end_date');

        $reportData = [];

        switch ($type) {
            case 'inventory':
                $reportData = $this->inventoryModel->findAll();
                break;
            case 'receiving':
                $reportData = $this->shipmentModel->getIncoming();
                break;
            case 'shipping':
                $reportData = $this->shipmentModel->getOutgoing();
                break;
            case 'approvals':
                $reportData = $this->approvalModel->findAll();