app/Controllers/WarehouseManagerController.php

    public function inventoryOverview()
    {
        $data['inventory'] = $this->inventoryModel->findAll();
---
SELECT *
FROM `inventory`