app/Models/InventoryModel.php

SELECT COUNT(*) AS `numrows`
FROM `inventory`
WHERE `quantity` < 10
SELECT DISTINCT `category`
FROM `inventory`
---
    public function getSummary()
    {
        return [
            'total_items' => $this->countAll(),
            'low_stock' => $this->where('quantity <', 10)->countAllResults(),
            'categories' => $this->distinct()->select('category')->findAll()

SELECT *
FROM `inventory`
---
    public function getAll()
    {
        return $this->findAll();